In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data=pd.Series(['arrdvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     arrdvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]=None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data=pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
#dropna와 같은 함수

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data=pd.DataFrame([[1.,6.5,3,],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [14]:
cleaned=data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df=pd.DataFrame(np.random.randn(7,3))

In [22]:
df.iloc[:4,1]=NA

In [23]:
df.iloc[:2,2]=NA

In [24]:
df

          0         1         2
0  0.312560       NaN       NaN
1 -1.598154       NaN       NaN
2 -0.465456       NaN  1.009870
3 -1.408995       NaN  1.105418
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [25]:
#iloc(:a,b)는 b열의 a-1번째 행

In [29]:
df.dropna()

          0         1         2
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [30]:
df.dropna(thresh=2)

          0         1         2
2 -0.465456       NaN  1.009870
3 -1.408995       NaN  1.105418
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [31]:
df.fillna(0)

          0         1         2
0  0.312560  0.000000  0.000000
1 -1.598154  0.000000  0.000000
2 -0.465456  0.000000  1.009870
3 -1.408995  0.000000  1.105418
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [32]:
#fillna(0)은 원래 nan값의 위치에 0을 집어넣는다.

In [33]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.312560  0.500000  0.000000
1 -1.598154  0.500000  0.000000
2 -0.465456  0.500000  1.009870
3 -1.408995  0.500000  1.105418
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [34]:
#dictonary를 통해서 각 열마다 다른 값을 넣어줄 수 있음

In [35]:
_=df.fillna(0,inplace=True)

In [36]:
df

          0         1         2
0  0.312560  0.000000  0.000000
1 -1.598154  0.000000  0.000000
2 -0.465456  0.000000  1.009870
3 -1.408995  0.000000  1.105418
4  1.311858  0.724078 -1.162456
5 -1.425745  0.509480 -1.348583
6  0.311874  0.399424 -1.063083

In [38]:
df=pd.DataFrame(np.random.randn(6,3))

In [39]:
df

          0         1         2
0  0.760679 -0.349927 -0.146960
1  0.881136  0.075918 -0.528449
2  1.411294  1.034193  1.539259
3  0.708922 -0.905327  2.743607
4 -0.917603 -1.374411 -0.195131
5 -0.359920 -0.231132  0.036154

In [40]:
df.iloc[2:,1]=NA

In [41]:
df.iloc[4:2,2]=NA

In [42]:
df

          0         1         2
0  0.760679 -0.349927 -0.146960
1  0.881136  0.075918 -0.528449
2  1.411294       NaN  1.539259
3  0.708922       NaN  2.743607
4 -0.917603       NaN -0.195131
5 -0.359920       NaN  0.036154

In [43]:
df.fillna(method='ffill')

          0         1         2
0  0.760679 -0.349927 -0.146960
1  0.881136  0.075918 -0.528449
2  1.411294  0.075918  1.539259
3  0.708922  0.075918  2.743607
4 -0.917603  0.075918 -0.195131
5 -0.359920  0.075918  0.036154

In [44]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.760679 -0.349927 -0.146960
1  0.881136  0.075918 -0.528449
2  1.411294  0.075918  1.539259
3  0.708922  0.075918  2.743607
4 -0.917603       NaN -0.195131
5 -0.359920       NaN  0.036154

In [45]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [46]:
data.fillna(data.mean())

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

In [47]:
#nan값에 data의 값의 평균을 넣음